app/Http/Controllers/productController.php

insert into `products` (`sku`, `nama_product`, `type`, `kategory`, `harga`, `quantity`, `foto`, `updated_at`, `created_at`) values ('BRG42500', 'Test', 'celana', 'pria', '12412', '412424214', '20231202_Screenshot_20231201_101215.png', '2023-12-02 19:30:21', '2023-12-02 19:30:21')
---
    public function store(Request $request)
    {
        $data = new product();

        $data->sku = $request->sku;
        $data->nama_product = $request->nama_product;
        $data->type = $request->type;
        $data->kategory = $request->kategory;
        $data->harga = $request->harga;
        $data->quantity = $request->quantity;

        if ($request->hasFile('foto')) {
            $photo = $request->file('foto');
            $filename = date('Ymd').'_'.$photo->getClientOriginalName();
            $photo->move(public_path('storage/product'), $filename);
            $data->foto = $filename;
        }
        $data->save();